# a = 0
# b = 787854
# c = -3
# d = -59856
#
# a1 = 4 ,5
# b1 = 4.54455
# c1 = -68454.25456

"""
float - вещественные числа - 3.5, 7.985
int - целочисленные значения - 2, -987, 325566555
a = 2 + 3.5
"""

#

# a = 8 / 2
# b = 3 / 6
#
# print(type(a))
# print(a)
# print(b)

# a = -7 // 2
#
# print(a)

#

# a = 123 % 10

# print(9 % 5) # 9 - 5 = 4 ( иногда необходимо, если в фин организации)
# print(-9 % 5) # наименьшее число которое делится на цело -10, -9 - (-10) = 1
# print(9 % -5)  # 9 - 10 = -1
# print(-9 % -5)  #  -9 - (-5) = -4

# a = 2 ** 3 # 2 * 2 * 2
# print(a)

# a = 2 + 4 * 7
# print(a)

# a = 1
# a /= 10 # a + 1
# print(a)